Repository: hmcts/courtfinder-search
Catalog: courtfinder/locale/*/LC_MESSAGES/django.po
Languages: cy

source: Court and tribunal finder
cy: Gwasanaeth chwilio am lysoedd a thribiwnlysoedd

source: English
cy: Saesneg

source: Welsh
cy: Cymraeg

source: Home
cy: Cartref

source: Find a court or tribunal
cy: Chwilio am lys neu dribiwnlys

source: Search by name of address
cy: Chwilio yn ôl enw neu gyfeiriad

source: Search results
cy: Canlyniadau eich chwiliad

source: Search by Court location code
cy: Chwilio yn ôl cod lleoliad y Llys

source: About your issue
cy: Ynglŷn â’ch mater

source: Additional info
cy: Gwybodaeth Ychwanegol

source: Search by postcode
cy: Chwilio yn ôl cod post

source: A-Z list of all courts
cy: Rhestr A-Y o'r holl lysoedd

source: Please note that information provided for venues in England will not be available in Welsh.
cy: Nodwch os gwelwch yn dda na fydd gwybodaeth am leoliadau yn Lloegr ar gael yn Gymraeg.

source: This court or tribunal is no longer in service. Business has been transferred to other neighbouring courts.
cy: Nid yw'r llys neu'r tribiwnlys hwn yn bodoli mwyach. Mae'r gwaith wedi'i drosglwyddo i lysoedd cyfagos.

source: Please use the postcode lookup facility to find your alternative court
cy: Defnyddiwch y cyfleuster chwilio gan ddefnyddio cod post i ddod o hyd i lys arall

source: Visit us:
cy: Ymwelwch â ni:

source: Maps and directions
cy: Mapiau a chyfarwyddiadau

source: Visit or write to us:
cy: Ymwelwch â ni neu ysgrifennwch atom:

source: Write to us:
cy: Ysgrifennwch atom:

source: Crown Court location code:
cy: Cod lleoliad Llys y Goron:

source: County Court location code:
cy: Cod lleoliad y Llys Sirol:

source: Magistrates' Court location code:
cy: Cod lleoliad y Llys Ynadon:

source: picture of the court or tribunal building
cy: llun o'r llys neu adeilad y tribiwnlys

source: Important information
cy: Gwybodaeth bwysig

source: Additional Information
cy: Gwybodaeth Ychwanegol

source: Opening hours
cy: Oriau agor

source: Email
cy: E-bost

source: Phone numbers
cy: Rhifau ffôn

source: Local information
cy: Gwybodaeth leol

source: Building facilities
cy: Cyfleusterau yn yr adeilad

source: If you have a disability and need help coming to a hearing, please contact the court or tribunal to make sure the facilities meet your specific needs or to discuss a reasonable adjustment you need.
cy: Os oes gennych anabledd a bod angen cymorth arnoch i ddod i wrandawiad, cysylltwch â’r llys neu’r tribiwnlys i wneud yn siŵr bod y cyfleusterau yno yn bodloni eich anghenion penodol neu i drafod addasiad rhesymol rydych ei angen.

source: More information...
cy: Mwy o wybodaeth...

source: Cases heard at this venue
cy: Achosion a wrandawir yn y lleoliad hwn

source: Useful links:
cy: Dolenni defnyddiol:

source: Entering our buildings
cy: Dod i mewn i'n hadeiladau

source: Open the Formfinder tool to obtain the right form for your issue.
cy: Defnyddiwch gwasanaeth Formfinder i ddod o hyd i'r ffurflen gywir ar gyfer eich mater.

source: Find a form
cy: Chwilio am ffurflen

source: Information on providing feedback about our services and making a complaint.
cy: Gwybodaeth am roi adborth am ein gwasanaethau a gwneud cwyn.

source: Make a complaint
cy: Gwneud cwyn

source: About jury service
cy: Ynghylch gwasanaethu ar reithgor

source: List of courts and tribunals starting with %(letter)s
cy: Rhestr o lysoedd a thribiwnlysoedd sy'n dechrau gyda'r lythyren %(letter)s

source: Index of all courts and tribunals
cy: Mynegai o'r holl lysoedd a thribiwnlysoedd

source: Courts and Tribunals
cy: Llysoedd a Thribiwnlysoedd

source: Browse by name of court or tribunal
cy: Pori drwy ddefnyddio enw'r llys neu dribiwnlys

source: There are no courts or tribunals starting with %(letter)s. Please select another letter.
cy: Nid oes yna lysoedd neu dribiwnlysoedd sy'n dechrau gyda'r lythyren %(letter)s. Dewiswch un arall.

source: Select the first letter of the court's name
cy: Dewiswch lythyren cyntaf enw'r llys

source: Names starting with %(letter)s
cy: Enwau sy'n dechrau gyda'r lythyren %(letter)s

source: Courts and Tribunals in Wales
cy: Llysoedd a Thribiwnlysoedd yng Nghymru

source: View complete list of all venues in English
cy: Rhestr lawn o'r holl leoliadau yn Saesneg

source: Search by name or address
cy: Chwilio yn ôl enw neu gyfeiriad

source: Error
cy: Gwall

source: You did not enter a search term. Please try again.
cy: Ni wnaethoch nodi term chwilio. Rhowch gynnig arall arni.

source: Sorry, there are no results for %(query)s. Please check and try another name or address.
cy: Nid oes yna unrhyw ganlyniadau ar gyfer %(query)s. Defnyddiwch enw neu gyfeiriad arall.

source: Enter one of the following
cy: Nodwch un o'r canlynol

source: court or tribunal name
cy: enw'r llys neu dribiwnlys

source: building name
cy: enw'r adeilad

source: street name
cy: enw'r stryd

source: town or city name
cy: enw'r dref neu ddinas

source: Continue
cy: Parhau

source: Find the right court or tribunal
cy: Chwilio am y llys neu dribiwnlys cywir

source: You did not enter a type of legal problem. Please try again.
cy: Ni wnaethoch nodi math o broblem cyfreithiol. Rhowch gynnig arall arni.

source: None of the above or not sure:
cy: Dim un o'r uchod neu ddim yn siŵr:

source: will display a list of the nearest courts to the postcode
cy: bydd yn dangos rhestr o'r llysoedd agosaf i'r cod post

source: Sorry, there are no results for %(query)s. Please check and try another court location code.
cy: Nid oes yna unrhyw ganlyniadau ar gyfer %(query)s. Defnyddiwch god lleoliad llys arall.

source: Crown Court location code
cy: Cod lleoliad Llys y Goron

source: County Court location code
cy: Cod lleoliad y Llys Sirol

source: Magistrates' Court location code
cy: Cod lleoliad y Llys Ynadon

source: Special notice:
cy: Hysbysiad arbennig:

source: Search by :
cy: Chwilio yn ôl:

source: The Area of Law I am interested in (recommended)
cy: Maes y Gyfraith y mae gennyf ddiddordeb ynddo (argymhellir)

source: Court Name or Address
cy: Enw neu Gyfeiriad y Llys

source: Court location code
cy: Cod lleoliad y Llys

source: Next
cy: Nesaf

source: Enter postcode
cy: Nodi cod post

source: Housing Possession
cy: Meddiannu Cartref

source: For a new claim:
cy: Gwneud hawliad newydd:

source: Enter your postcode.
cy: Nodwch eich cod post.

source: For an existing claim:
cy: Ar gyfer hawliad sydd eisoes yn bodoli:

source: You did not enter a postcode. Please try again.
cy: Ni wnaethoch nodi cod post. Rhowch gynnig arall arni.

source: You did not enter a valid postcode. Please try again.
cy: Ni wnaethoch nodi cod post dilys. Rhowch gynnig arall arni.

source: Aside from immigration tribunals, this tool does not return results for Northern Ireland.
cy: Ar wahân i dribiwnlysoedd mewnfudo, nid yw'r gwasanaeth hwn yn rhoi canlyniadau ar gyfer Gogledd Iwerddon.

source: <a id="money-claims-online-link" href="https://www.gov.uk/make-money-claim-online" target="_blank">Making a money claim online</a> is cheaper and submitting it takes 30 minutes.
cy: Mae <a id="money-claims-online-link" href="https://www.gov.uk/make-money-claim-online" target="_blank">Gwneud hawliad arian ar-lein</a> yn costio llai ac yn cymryd 30 munud i'w gwblhau.

source: or
cy: neu

source: Contact the County Court Money Claims Centre (CCMCC)
cy: Cysylltwch â Chanolfan Hawliadau Arian y Llys Sirol (CCMCC)

source: That was previously entered online
cy: A gafodd ei gyflwyno'n flaenorol ar-lein

source: Go to the Online Money Claim Service
cy: Ewch i'r Gwasanaeth Hawliadau Arian Ar-lein

source: That was previously completed on paper
cy: A gafodd ei gwblhau'n flaenorol ar bapur

source: If you know a local court is dealing with your claim
cy: Os ydych chi'n gwybod bod llys lleol yn delio â'ch hawliad

source: Go to the A-Z list of courts
cy: Ewch i'r rhestr A-Y o'r holl lysoedd

source: Enter the postcode where the child (or children) lives.
cy: Nodwch god post lle mae'r plentyn (neu'r plant) yn byw.

source: Start a Possession claim online
cy: Dechrau hawliad Meddiant ar-lein

source: Or enter postcode of property to find nearest court.
cy: Neu nodwch god post yr eiddo i chwilio am y llys agosaf.

source: You will be directed to your Regional Divorce Centre.
cy: Fe'ch cyfeirir at eich Canolfan Ysgariadau Rhanbarthol.

source: result
cy: canlyniad

source: The nearest County Court for your hearing is:
cy: Y Llys Sirol agosaf ar gyfer eich gwrandawiad yw:

source: The nearest County Courts for your hearing are:
cy: Y Llysoedd Sirol agosaf ar gyfer eich gwrandawiad yw:

source: This is the court or tribunal nearest %(postcode)s.
cy: Dyma'r llys neu dribiwnlys sydd agosaf at %(postcode)s.

source: These are the %(results)s courts or tribunals nearest %(postcode)s.
cy: Dyma'r %(results)s llys a thribiwnlys sydd agosaf at %(postcode)s.

source: This tool shows courts and tribunals in England and Wales, and some tribunals in Scotland and Northern Ireland.
cy: Mae'r gwasanaeth hwn yn dangos llysoedd a tribiwnlysoedd yng Nghymru a Lloegr, a rhai thribiwnlysoedd yn Yr Alban a Gogledd Iwerddon.

source: Some tribunal hearings may take place at other venues.
cy: Efallai y cynhelir rhai gwrandawiadau tribiwnlys mewn lleoliadau eraill.

source: Social Security and Child Support Tribunal Venues
cy: Lleoliadau Tribiwnlys Nawdd Cymdeithasol a Chynnal Plant

source: Employment Tribunal Venues
cy: Lleoliadau Tribiwnlys Cyflogaeth

source: document exchange
cy: cyfnewid dogfen

source: More details about
cy: Rhagor o fanylion am

source: Children
cy: Plant

source: About your Divorce
cy: Ynghylch eich Ysgariad

source: About your money claim
cy: Ynghylch eich hawliad arian

source: About ending your Civil Partnership
cy: Ynghylch diweddu eich Partneriaeth Sifil

source: I want to start new proceedings
cy: Rwyf eisiau dechrau achos newydd

source: I want to start proceedings
cy: Rwyf eisiau dechrau achos

source: about to start a new claim
cy: rwyf ar fin dechrau hawliad newydd

source: I am already in contact with a court
cy: Rwyf eisoes mewn cysylltiad â llys

source: already have a claim
cy: rwyf wedi gwneud hawliad yn barod

source: already in contact with a court or tribunal
cy: eisoes mewn cysylltiad â llys neu dribiwnlys

source: locate nearest county court for hearing
cy: chwilio am y llys sirol agosaf ar gyfer gwrandawiad

source: Adoption
cy: Mabwysiadu

source: applying to adopt a child.
cy: gwneud cais i fabwysiadu plentyn.

source: Bankruptcy
cy: Methdaliad

source: declaring bankruptcy or being made bankrupt.
cy: Datgan methdaliad neu gael eich dyfarnu'n fethdalwr.

source: Civil partnership
cy: Partneriaeth sifil

source: ending a civil partnership.
cy: diweddu partneriaeth sifil.

source: child contact issues and disputes over maintenance payments.
cy: materion cyswllt â phlant ac anghydfodau ynghylch taliadau cynhaliaeth.

source: Crime
cy: Trosedd

source: being accused of a crime, being a victim or witness.
cy: wedi cael eich cyhuddo o gyflawni trosedd, yn ddioddefwr neu'n dyst.

source: Divorce
cy: Ysgariad

source: ending a marriage.
cy: diweddu priodas.

source: Domestic violence
cy: Trais domestig

source: violence in the home.
cy: trais yn y cartref.

source: Employment
cy: Cyflogaeth

source: workplace disputes including pay, redundancy and discrimination.
cy: anghydfodau yn y gweithle gan gynnwys tâl, colli swydd a gwahaniaethu.

source: Forced marriage
cy: Priodas dan orfod

source: being made to marry against your will.
cy: cael eich gorfodi i briodi yn erbyn eich ewyllys.

source: Forced marriage and FGM
cy: Priodas dan orfod ac anffurfio organau cenhedlu benywod

source: being made to marry or undergo mutilation against your will.
cy: cael eich gorfodi i briodi neu anffurfio eich organau yn erbyn eich ewyllys.

source: Housing possession
cy: Meddiannu cartref

source: Evictions and rental disputes.
cy: Troi allan ac anghydfodau rhent.

source: High court
cy: Yr Uchel Lys

source: courts dealing with High Court matters
cy: llysoedd sy'n delio â materion yr Uchel Lys

source: High Court District Registry
cy: Cofrestrfa Ddosbarth Yr Uchel Lys

source: Immigration
cy: Mewnfudo

source: seeking asylum, right to live in the UK and appealing deportation.
cy: ceisio lloches, hawl i fyw yn y DU ac apelio yn erbyn allgludiad.

source: Money claims
cy: Hawliadau arian

source: small claims, consumer, negligence and personal injury claims.
cy: hawliadau bychain, hawliadau defnyddwyr, esgeuluster ac anafiadau personol.

source: Probate
cy: Profiant

source: will settlement and disputes.
cy: setlo ewyllys ac anghydfodau.

source: Social security
cy: Nawdd cymdeithasol

source: problems with benefits, entitlement, assessment and decisions.
cy: problemau gyda'r hawl i hawlio, asesiadau a phenderfyniadau budd-daliadau.

source: Court and Tribunal Finder
cy: Gwasanaeth Chwilio am Lysoedd a Thribiwnlysoedd

source: Feedback
cy: Adborth

source: Send feedback
cy: Anfon adborth

source: Please do not use this feedback form for complaints about HM Courts & Tribunals Service. Complaints should be sent to the office where the problem arose to help us sort out the issue quickly and accurately.
cy: Peidiwch â defnyddio’r ffurflen adborth hon i wneud cwyn am Wasanaeth Llysoedd a Thribiwnlysoedd EM. Dylech anfon cwynion i’r swyddfa lle digwyddodd y broblem i’n helpu i ddatrys y mater yn gyflym ac yn briodol.

source: Comments (Please don't leave sensitive personal details, like your phone number)
cy: Sylwadau (Peidiwch â nodi gwybodaeth bersonol sensitif, fel eich rhif ffôn)

source: 2000 characters max
cy: uchafswm o 2000 o nodau

source: Your email address (optional) - if you'd like us to contact you for more feedback
cy: Eich cyfeiriad e-bost (dewisol) - os hoffech i ni gysylltu â chi i gael mwy o adborth

source: Leave this field blank
cy: Gadewch y maes hwn yn wag

source: Feedback sent
cy: Adborth wedi'i anfon

source: Thank you for your feedback
cy: Diolch yn fawr am eich adborth

source: We're sorry, but your browser sent a request that this server could not understand.
cy: Mae'n ddrwg gennym, ond bu i'ch porwr anfon cais na all y gweinydd hwn ei ddeall.

source: Go to the <a href="%(home_url)s">home page</a>
cy: Mynd i'r <a href="%(home_url)s">dudalen gartref</a>

source: Page not found
cy: Ni ddaethpwyd o hyd i'r dudalen

source: We're sorry, but something went wrong
cy: Mae'n ddrwg gennym, ond aeth rhywbeth o'i le

source: This is a new service - <a href="%(feedback_url)s">your feedback</a> will help us to improve it.
cy: Mae hwn yn wasanaeth newydd - <a href="%(feedback_url)s">bydd eich adborth</a> yn ein helpu i'w wella.

source: Help
cy: Cymorth

source: Cookies
cy: Cwcis

source: Contact
cy: Cysylltu
